vladyslavmarkovaccenture/reference/platforms/s32k148evb/main/src/bsp/startUp.S
    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x1c*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x1c*/
/* ISR reloction */
    ISB
    DSB
    DMB
    ldr r0, =_NVIC_VTOR
    ldr r1, =__isr_vector
    str r1, [r0]
    ldr r0, [r1]
    mov sp, r0
    ldr r0, [r1, #4]
    ISB
    DSB
    DMB

    /* enable fpu */
    ldr r0, = _CPACR
    ldr r1, [r0]
    orr r1, r1, #0x00F00000
    str r1, [r0]

    /* Init the rest of the registers */
    ldr     r1,=0
    ldr     r2,=0
    ldr     r3,=0
    ldr     r4,=0
    ldr     r5,=0
    ldr     r6,=0
    ldr     r7,=0
    mov     r8,r7
    mov     r9,r7
    mov     r10,r7
    mov     r11,r7
    mov     r12,r7
    /* Initialize the stack pointer */
    ldr     r0,=__StackTop
    mov     r13,r0
/* c code call stack init .*/
    subs r0, 32
    str r1, [r0,r3]    /*0*/
    movs    r3, #4
    str r1, [r0,r3]    /*4*/
    add r0, r0, r3
    str r1, [r0,r3]    /*8*/
    add r0, r0, r3
    str r1, [r0,r3]    /*12*/
    add r0, r0, r3
    str r1, [r0,r3]    /*16*/
    add r0, r0, r3
    str r1, [r0,r3]    /*20*/
    add r0, r0, r3
    str r1, [r0,r3]    /*24*/
    add r0, r0, r3
    str r1, [r0,r3]    /*28*/

    bl boardInit

    cpsie   i               /* Unmask interrupts */

    /* Init ECC RAM */

    ldr r1, =__DATA_RAM
    ldr r2, =__DATA_RAM_END

    subs    r2, r1
    ble .LC5

    movs    r0, 0
    movs    r3, #4
.LC4:
    str r0, [r1]
    add r1, r1, r3
    subs r2, 4
    bgt .LC4
.LC5:

/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

    subs    r3, r2
    ble     .LC0

.LC1:
    subs    r3, 4
    ldr    r0, [r1,r3]
    str    r0, [r2,r3]
    bgt    .LC1
.LC0:

/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    subs    r2, r1
    ble .LC3

    movs    r0, 0
.LC2:
    str r0, [r1, r2]
    subs    r2, 4
    bge .LC2
.LC3:

/*
 * Zero out the MPU protected BSS section
 */
    ldr r1, =__MPU_BSS_START
    ldr r2, =__MPU_BSS_END

    subs    r2, r1
    ble .LC7

    movs    r0, 0
.LC6:
    str r0, [r1, r2]
    subs    r2, 4
    bge .LC6
.LC7:

#ifndef __START
#define __START _start
#endif
	bl    __libc_init_array

    bl    main /*__START*/
    .pool
    .size Reset_Handler, . - Reset_Handler


    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b       DefaultISR
    .size DefaultISR, . - DefaultISR

Exception:
     cpsid   i               /* Mask interrupts */
     b    Exception

    .section .__startUpSection, "a"
    .thumb_func
    .align 2
    .globl   __start
__start:
    ldr r2, =Reset_Handler
    bx  r2

.end
